ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/ref_a.xml
<module id="REF_A" HW_revision=""><register id="CTL0" width="16" offset="0x0" internal="0" description="REF Control Register 0"><bitfield id="ON" description="Reference enable. Can be modified only when REFGENBUSY = 0." begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ON__0" value="0" description="Disables reference if no other reference requests are pending"/><bitenum id="ON__1" value="1" description="Enables reference in static mode"/></bitfield><bitfield id="OUT" description="Reference output buffer" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Reference output not available externally"/><bitenum id="OUT__1" value="1" description="Reference output available externally"/></bitfield><bitfield id="TCOFF" description="Temperature sensor disabled" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="TCOFF__0" value="0" description="Temperature sensor enabled"/><bitenum id="TCOFF__1" value="1" description="Temperature sensor disabled to save power"/></bitfield><bitfield id="VSEL" description="Reference voltage level select" begin="5" end="4" width="2" rwaccess="R/W"><bitenum id="VSEL__0" value="0" description="1.2 V available when reference requested or REFON = 1"/><bitenum id="VSEL__1" value="1" description="1.45 V available when reference requested or REFON = 1"/><bitenum id="VSEL__3" value="3" description="2.5 V available when reference requested or REFON = 1"/></bitfield><bitfield id="GENOT" description="Reference generator one-time trigger" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="GENOT__0" value="0" description="No trigger"/><bitenum id="GENOT__1" value="1" description="Generation of the reference voltage is started by writing 1 or "/></bitfield><bitfield id="BGOT" description="Bandgap and bandgap buffer one-time trigger" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="BGOT__0" value="0" description="No trigger"/><bitenum id="BGOT__1" value="1" description="Generation of the bandgap voltage is started by writing 1 or by"/></bitfield><bitfield id="GENACT" description="Reference generator active." begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="GENACT__0" value="0" description="Reference generator not active"/><bitenum id="GENACT__1" value="1" description="Reference generator active"/></bitfield><bitfield id="BGACT" description="Reference bandgap active." begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="BGACT__0" value="0" description="Reference bandgap buffer not active"/><bitenum id="BGACT__1" value="1" description="Reference bandgap buffer active"/></bitfield><bitfield id="GENBUSY" description="Reference generator busy." begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="GENBUSY__0" value="0" description="Reference generator not busy"/><bitenum id="GENBUSY__1" value="1" description="Reference generator busy"/></bitfield><bitfield id="BGMODE" description="Bandgap mode." begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="BGMODE__0" value="0" description="Static mode"/><bitenum id="BGMODE__1" value="1" description="Sampled mode"/></bitfield><bitfield id="GENRDY" description="Variable reference voltage ready status." begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="GENRDY__0" value="0" description="Reference voltage output is not ready to be used"/><bitenum id="GENRDY__1" value="1" description="Reference voltage output is ready to be used"/></bitfield><bitfield id="BGRDY" description="Buffered bandgap voltage ready status." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="BGRDY__0" value="0" description="Buffered bandgap voltage is not ready to be used"/><bitenum id="BGRDY__1" value="1" description="Buffered bandgap voltage is ready to be used"/></bitfield></register></module>